feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/iLLD/TC27D/Tricore/Multican/Std/IfxMultican.h
/**
 * \file IfxMultican.h
 * \brief MULTICAN  basic functionality
 * \ingroup IfxLld_Multican
 *
 * \version iLLD_1_0_1_16_1
 * \copyright Copyright (c) 2023 Infineon Technologies AG. All rights reserved.
 *
 *
 *
 *                                 IMPORTANT NOTICE
 *
 * Use of this file is subject to the terms of use agreed between (i) you or
 * the company in which ordinary course of business you are acting and (ii)
 * Infineon Technologies AG or its licensees. If and as long as no such terms
 * of use are agreed, use of this file is subject to following:
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 *
 * \defgroup IfxLld_Multican_Std_Enum Enumerations
 * \ingroup IfxLld_Multican_Std
 * \defgroup IfxLld_Multican_Std_General General functions
 * \ingroup IfxLld_Multican_Std
 * \defgroup IfxLld_Multican_Std_Node CAN Nodes
 * \ingroup IfxLld_Multican_Std
 * \defgroup IfxLld_Multican_Std_Message Message
 * \ingroup IfxLld_Multican_Std
 * \defgroup IfxLld_Multican_Std_Message_Objects Message Objects
 * \ingroup IfxLld_Multican_Std
 * \defgroup IfxLld_Multican_Std_Interrupts Interrupts
 * \ingroup IfxLld_Multican_Std
 */

#ifndef IFXMULTICAN_H
#define IFXMULTICAN_H 1

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/

#include "_Impl/IfxMultican_cfg.h"
#include "Src/Std/IfxSrc.h"
#include "_PinMap/IfxMultican_PinMap.h"
#include "Cpu/Std/IfxCpu_Intrinsics.h"
#include "IfxCan_bf.h"
#include "Scu/Std/IfxScuWdt.h"
#include "_Utilities/Ifx_Assert.h"
#include "_Utilities/Ifx_Assert.h"

/******************************************************************************/
/*------------------------------Type Definitions------------------------------*/
/******************************************************************************/

/** \brief Message object ID, 0 .. \ref IFXMULTICAN_NUM_MESSAGE_OBJECTS
 */
typedef sint32 IfxMultican_MsgObjId;

/******************************************************************************/
/*--------------------------------Enumerations--------------------------------*/
/******************************************************************************/

/** \addtogroup IfxLld_Multican_Std_Enum
 * \{ */
/** \brief CAN input clock selection
 */
typedef enum
{
    IfxMultican_ClockSelect_noClock  = 0, /**< \brief No clock supplied */
    IfxMultican_ClockSelect_fclc     = 1, /**< \brief fMULTICAN */
    IfxMultican_ClockSelect_fosc0    = 2, /**< \brief Oscillator Clock */
    IfxMultican_ClockSelect_fErayPll = 4  /**< \brief E-Ray clock */
} IfxMultican_ClockSelect;

/** \brief CAN frame data length code
 * Definition in Ifx_CAN.MOFCRx.DLC
 */
typedef enum
{
    IfxMultican_DataLengthCode_0 = 0,    /**< \brief 0 data bytes  */
    IfxMultican_DataLengthCode_1,        /**< \brief 1 data bytes  */
    IfxMultican_DataLengthCode_2,        /**< \brief 2 data bytes  */
    IfxMultican_DataLengthCode_3,        /**< \brief 3 data bytes  */
    IfxMultican_DataLengthCode_4,        /**< \brief 4 data bytes  */
    IfxMultican_DataLengthCode_5,        /**< \brief 5 data bytes  */
    IfxMultican_DataLengthCode_6,        /**< \brief 6 data bytes  */
    IfxMultican_DataLengthCode_7,        /**< \brief 7 data bytes  */
    IfxMultican_DataLengthCode_8,        /**< \brief 8 data bytes  */
    IfxMultican_DataLengthCode_12 = 9,   /**< \brief 12 data bytes */
    IfxMultican_DataLengthCode_16 = 10,  /**< \brief 16 data bytes */
    IfxMultican_DataLengthCode_20 = 11,  /**< \brief 20 data bytes */
    IfxMultican_DataLengthCode_24 = 12,  /**< \brief 24 data bytes */
    IfxMultican_DataLengthCode_32 = 13,  /**< \brief 32 data bytes */
    IfxMultican_DataLengthCode_48 = 14,  /**< \brief 48 data bytes */
    IfxMultican_DataLengthCode_64 = 15   /**< \brief 64 data bytes */
} IfxMultican_DataLengthCode;

/** \brief CAN frame type
 */
typedef enum
{
    IfxMultican_Frame_receive,        /**< \brief Data frame is received */
    IfxMultican_Frame_transmit,       /**< \brief Data frame is generated */
    IfxMultican_Frame_remoteRequest,  /**< \brief Remote request frame is generated */
    IfxMultican_Frame_remoteAnswer    /**< \brief Answer frame is generated on reception of the corresponding remote request */
} IfxMultican_Frame;

/** \brief Determines the operation mode of the frame counter\n
 * Definition in Ifx_CAN.NFCRx.B.CFMOD, (x= node Id)
 */
typedef enum
{
    IfxMultican_FrameCounterMode_frameCountMode = 0,  /**< \brief The frame counter is incremented
                                                       * upon the reception and transmission of frames */
    IfxMultican_FrameCounterMode_timeStampMode  = 1,  /**< \brief The frame counter is used to count
                                                       * bit times. */
    IfxMultican_FrameCounterMode_bitTimingMode  = 2,  /**< \brief The frame counter is used for
                                                       * analysis of the bit timing. */
    IfxMultican_FrameCounterMode_errorCountMode = 3   /**< \brief The frame counter is used for
                                                       * counting when an error frame is received or an error is
                                                       * detected by the node. */
} IfxMultican_FrameCounterMode;

/** \brief CAN message object group\n
 * Each group consists of 32 consecutive message objects
 */
typedef enum
{
    IfxMultican_MsgObjGroup_0 = 0,
    IfxMultican_MsgObjGroup_1,
    IfxMultican_MsgObjGroup_2,
    IfxMultican_MsgObjGroup_3,
    IfxMultican_MsgObjGroup_4,
    IfxMultican_MsgObjGroup_5,
    IfxMultican_MsgObjGroup_6,
    IfxMultican_MsgObjGroup_7
} IfxMultican_MsgObjGroup;

/** \brief CAN Message Object Mode
 */
typedef enum
{
    IfxMultican_MsgObjMode_standard          = 0,  /**< \brief Standard Message Object */
    IfxMultican_MsgObjMode_receiveFifoBase   = 1,  /**< \brief Receive FIFO Base Object */
    IfxMultican_MsgObjMode_transmitFifoBase  = 2,  /**< \brief Transmit FIFO Base Object */
    IfxMultican_MsgObjMode_transmitFifoSlave = 3,  /**< \brief Transmit FIFO Slave Object */
    IfxMultican_MsgObjMode_gatewaySource     = 4,  /**< \brief Gateway Source Object */
    IfxMultican_MsgObjMode_canFD64           = 5   /**< \brief CANFD 64 bytes Message Mode */
} IfxMultican_MsgObjMode;

/** \brief CAN Message Object status flag
 * Definition in Ifx_CAN.MOSTATx (x: 0 to max number of msg objs)
 */
typedef enum
{
    IfxMultican_MsgObjStatusFlag_receivePending          = IFX_CAN_MO_STAT_RXPND_OFF,  /**< \brief Receive pending status flag */
    IfxMultican_MsgObjStatusFlag_transmitPending         = IFX_CAN_MO_STAT_TXPND_OFF,  /**< \brief Transmit pending status flag */
    IfxMultican_MsgObjStatusFlag_receiveUpdating         = IFX_CAN_MO_STAT_RXUPD_OFF,  /**< \brief Receive updating status flag */
    IfxMultican_MsgObjStatusFlag_newData                 = IFX_CAN_MO_STAT_NEWDAT_OFF, /**< \brief New data status flag */
    IfxMultican_MsgObjStatusFlag_messageLost             = IFX_CAN_MO_STAT_MSGLST_OFF, /**< \brief Message lost status flag */
    IfxMultican_MsgObjStatusFlag_messageValid            = IFX_CAN_MO_STAT_MSGVAL_OFF, /**< \brief Message valid status flag */
    IfxMultican_MsgObjStatusFlag_receiveTransmitSelected = IFX_CAN_MO_STAT_RTSEL_OFF,  /**< \brief Receive transmit selected status flag */
    IfxMultican_MsgObjStatusFlag_receiveEnable           = IFX_CAN_MO_STAT_RXEN_OFF,   /**< \brief Receive enable status flag */
    IfxMultican_MsgObjStatusFlag_transmitRequest         = IFX_CAN_MO_STAT_TXRQ_OFF,   /**< \brief Transmit request status flag */
    IfxMultican_MsgObjStatusFlag_transmitEnable0         = IFX_CAN_MO_STAT_TXEN0_OFF,  /**< \brief Transmit enable 0 status flag */
    IfxMultican_MsgObjStatusFlag_transmitEnable1         = IFX_CAN_MO_STAT_TXEN1_OFF,  /**< \brief Transmit enable 1 status flag */
    IfxMultican_MsgObjStatusFlag_messageDirection        = IFX_CAN_MO_STAT_DIR_OFF     /**< \brief Message direction status flag */
} IfxMultican_MsgObjStatusFlag;

/** \brief CAN priorities
 */
typedef enum
{
    IfxMultican_Priority_ListOrder = 1,  /**< \brief List order */
    IfxMultican_Priority_CAN_ID    = 2   /**< \brief CAN ID */
} IfxMultican_Priority;

/** \brief Enable/disable the sensitivity of the module to sleep signal\n
 * Definition in Ifx_CAN.CLC.B.EDIS
 */
typedef enum
{
    IfxMultican_SleepMode_enable  = 0, /**< \brief enables sleep mode */
    IfxMultican_SleepMode_disable = 1  /**< \brief disables sleep mode */
} IfxMultican_SleepMode;

