feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/iLLD/TC27D/Tricore/Multican/Std/IfxMultican.h
/** \brief CAN API status definition
 */
typedef enum
{
    IfxMultican_Status_ok                = 0x00000000,
    IfxMultican_Status_notInitialised    = 0x00000001,
    IfxMultican_Status_wrongParam        = 0x00000002,
    IfxMultican_Status_wrongPin          = 0x00000004,
    IfxMultican_Status_busHeavy          = 0x00000008,
    IfxMultican_Status_busOff            = 0x00000010,
    IfxMultican_Status_notSentBusy       = 0x00000020,
    IfxMultican_Status_receiveEmpty      = 0x00000040,
    IfxMultican_Status_messageLost       = 0x00000080,
    IfxMultican_Status_newData           = 0x00000100,
    IfxMultican_Status_newDataButOneLost = IfxMultican_Status_messageLost | IfxMultican_Status_newData
} IfxMultican_Status;

/** \brief OCDS Suspend Control (OCDS.SUS)
 */
typedef enum
{
    IfxMultican_SuspendMode_none = 0,  /**< \brief No suspend */
    IfxMultican_SuspendMode_hard = 1,  /**< \brief Hard Suspend */
    IfxMultican_SuspendMode_soft = 2   /**< \brief Soft Suspend */
} IfxMultican_SuspendMode;

/** \} */

/******************************************************************************/
/*-----------------------------Data Structures--------------------------------*/
/******************************************************************************/

/** \brief CAN message definition
 */
typedef struct
{
    uint32                     id;                /**< \brief CAN message ID */
    IfxMultican_DataLengthCode lengthCode;        /**< \brief CAN message data length code */
    uint32                     data[2];           /**< \brief CAN message data */
    boolean                    fastBitRate;       /**< \brief CAN FD fast bit rate enable/disable */
} IfxMultican_Message;

/** \brief Message object status bit-fields
 */
typedef union
{
    Ifx_CAN_MO_STAT_Bits B;
    unsigned int         U;
} IfxMultican_MsgObjStat;

/** \addtogroup IfxLld_Multican_Std_General
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief clears the message pending interrupt notification of a given list
 * \param mcan mcan Specifies the CAN module
 * \return None
 */
IFX_INLINE void IfxMultican_clearMessagePendingSeletor(Ifx_CAN *mcan);

/** \brief clears the message pending interrupt notification of a given list
 * \param mcan mcan Specifies the CAN module
 * \param list List number
 * \return None
 */
IFX_INLINE void IfxMultican_clearPendingMessageNotification(Ifx_CAN *mcan, uint16 list);

/** \brief Disables the module (sets the disable request)
 * \param mcan mcan Specifies the CAN module
 * \return None
 */
IFX_INLINE void IfxMultican_disableModule(Ifx_CAN *mcan);

/** \brief Disregards the sleep mode of the module
 * \param mcan mcan Specifies the CAN module
 * \return None
 */
IFX_INLINE void IfxMultican_disableSleepMode(Ifx_CAN *mcan);

/** \brief Enables the module (clears the disable request)
 * \param mcan mcan Specifies the CAN module
 * \return None
 */
IFX_INLINE void IfxMultican_enableModule(Ifx_CAN *mcan);

/** \brief Enables the sleep mode of the module
 * \param mcan mcan Specifies the CAN module
 * \return None
 */
IFX_INLINE void IfxMultican_enableSleepMode(Ifx_CAN *mcan);

/** \brief Returns the selected fractional divider mode
 * \param mcan mcan Specifies the CAN module
 * \return Divider mode
 */
IFX_INLINE uint16 IfxMultican_getFractionalDividerMode(Ifx_CAN *mcan);

/** \brief Returns the reload or addition value for the result.
 * \param mcan mcan Specifies the CAN module
 * \return Step Value
 */
IFX_INLINE uint16 IfxMultican_getFractionalDividerStepValue(Ifx_CAN *mcan);

/** \brief Returns the selected input clock source
 * \param mcan mcan Specifies the CAN module
 * \return Clock selection
 */
IFX_INLINE IfxMultican_ClockSelect IfxMultican_getInputClock(Ifx_CAN *mcan);

/** \brief Returns the status of module enabled or disabled
 * \param mcan mcan Specifies the CAN module
 * \return Status (TRUE / FALSE)
 */
IFX_INLINE boolean IfxMultican_isModuleEnabled(Ifx_CAN *mcan);

/** \brief sets the fractional divider mode
 * \param mcan mcan Specifies the CAN module
 * \param mode Divider mode
 * \return None
 */
IFX_INLINE void IfxMultican_setFractionalDividerMode(Ifx_CAN *mcan, uint16 mode);

/** \brief sets reload or addition value for the result.
 * \param mcan mcan Specifies the CAN module
 * \param stepValue Step Value
 * \return None
 */
IFX_INLINE void IfxMultican_setFractionalDividerStepValue(Ifx_CAN *mcan, uint16 stepValue);

/** \brief Sets the input clock source
 * \param mcan mcan Specifies the CAN module
 * \param clockSelect Clock selection
 * \return None
 */
IFX_INLINE void IfxMultican_setInputClock(Ifx_CAN *mcan, IfxMultican_ClockSelect clockSelect);

/** \brief clears the message pending interrupt notification of a given list
 * \param mcan mcan Specifies the CAN module
 * \param mask Message Index mask
 * \return None
 */
IFX_INLINE void IfxMultican_setMessageIndexMask(Ifx_CAN *mcan, uint32 mask);

/** \brief Sets the sensitivity of the module to sleep signal
 * \param can pointer to CAN registers
 * \param mode mode selection (enable / disable)
 * \return None
 */
IFX_INLINE void IfxMultican_setSleepMode(Ifx_CAN *can, IfxMultican_SleepMode mode);

/** \brief Wait until the list panel is ready
 * \param mcan mcan Specifies the CAN module
 * \return None
 */
IFX_INLINE void IfxMultican_waitListReady(Ifx_CAN *mcan);

/** \brief Returns the module's suspend state.
 * TRUE :if module is suspended.
 * FALSE:if module is not yet suspended.
 * \param mcan Pointer to MULTICAN module registers
 * \return Suspend status (TRUE / FALSE)
 */
IFX_INLINE boolean IfxMultican_isModuleSuspended(Ifx_CAN *mcan);

/** \brief Set the Module to Hard/Soft suspend mode.
 * Note: The api works only when the OCDS is enabled and in Supervisor Mode. When OCDS is disabled the OCS suspend control is ineffective.
 * \param mcan Pointer to MULTICAN module registers
 * \param mode Module suspend mode
 * \return None
 */
IFX_INLINE void IfxMultican_setSuspendMode(Ifx_CAN *mcan, IfxMultican_SuspendMode mode);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Calculates the best posible values and configures FBTR register
 * \param hwNode Pointer to CAN Node registers
 * \param moduleFreq Specifies the CAN module frequency
 * \param baudrate Specifies the node baud rate. Unit: baud
 * \param samplePoint Specifies the sample point. Range = [0, 10000] resp. [0%, 100%] of the total bit time.
 * \param synchJumpWidth synchJumpWidth Specifies the re-synchronization jump width.\n
 * Range = [0, 10000] resp. [0%, 100%] of the total bit time.
 * \return None
 */
IFX_EXTERN void IfxMultican_Node_setFastBitTiming(Ifx_CAN_N *hwNode, float32 moduleFreq, uint32 baudrate, uint16 samplePoint, uint16 synchJumpWidth);

/** \brief Calculates the best posible values and configures BTEVR register
 * \param hwNode Pointer to CAN Node registers
 * \param moduleFreq Specifies the CAN module frequency
 * \param baudrate Specifies the node baud rate. Unit: baud
 * \param samplePoint Specifies the sample point. Range = [0, 10000] resp. [0%, 100%] of the total bit time.
 * \param synchJumpWidth synchJumpWidth Specifies the re-synchronization jump width.\n
 * Range = [0, 10000] resp. [0%, 100%] of the total bit time.
 * \return None
 */
IFX_EXTERN void IfxMultican_Node_setNominalBitTiming(Ifx_CAN_N *hwNode, float32 moduleFreq, uint32 baudrate, uint16 samplePoint, uint16 synchJumpWidth);

/** \brief Reset the CAN module\n
 * Reset and disable the CAN module, inclusive message object and node registers.
 * \param mcan Specifies the CAN module
 * \return None
 */
IFX_EXTERN void IfxMultican_deinit(Ifx_CAN *mcan);

/** \brief resets Multican kernel
 * \param can pointer to CAN registers
 * \return None
 */
IFX_EXTERN void IfxMultican_resetModule(Ifx_CAN *can);

/** \brief Execute a command from the command panel
 * \param mcan Specifies the CAN module
 * \param cmd Specifies the command
 * \param arg2 Specifies the second argument
 * \param arg1 Specifies the first argument
 * \return None
 */
IFX_EXTERN void IfxMultican_setListCommand(Ifx_CAN *mcan, uint32 cmd, uint32 arg2, uint32 arg1);

/** \brief API to get the resource index of the CAN specified.
 * \return multican resource index
 */
IFX_EXTERN IfxMultican_Index IfxMultican_getIndex(Ifx_CAN *multican);

/**
 * \param multican Module index of the MULTICAN
 * \return MULTICAN module register address
 */
IFX_EXTERN Ifx_CAN *IfxMultican_getAddress(IfxMultican_Index multican);

